dayList =[]

allSubjectsDic = {
    'Англ. яз.':[],
    'Астрономия':[],
    'Бел. лит.':[],
    'Бел. яз.': [],
    'Биология': [],
    'Всемир. ист.': [],
    'География': [],
    'ДП/МП': [],
    'Информ.': [],
    'Ист. Бел.': [],
    'Матем.': [],
    'Обществов.': [],
    'Рус. лит.': [],
    'Рус. яз.': [],
    'Физика': [],
    'Физ. к. и зд.': [],
    'Фр. яз.': [],
    'Химия': [],
    'ЧЗС': [],

}

allSubjectsDic2 = {
    'Англ. яз.':[],
    'Астрономия':[],
    'Бел. лит.':[],
    'Бел. яз.': [],
    'Биология': [],
    'Всемир. ист.': [],
    'География': [],
    'ДП/МП': [],
    'Информ.': [],
    'Ист. Бел.': [],
    'Матем.': [],
    'Обществов.': [],
    'Рус. лит.': [],
    'Рус. яз.': [],
    'Физика': [],
    'Физ. к. и зд.': [],
    'Фр. яз.': [],
    'Химия': [],
    'ЧЗС': [],

}